

const x = {
    13: ["Jack", "Alex"],
    14: ["George", "Andrew"],
    17: ["Ann", "Raze", "Eva"]
};

console.log(x);

// разделение кода на функции и модули - декомпозиция
// твой код правильно разделить на две функции
// расчёт объекта вычислений как в примере x
// вывод в логи
// Дз. 1. Посчитать x
// 4. 3 + удалять все не буквенные символы _sF@ghjароПП234 =>> SFGHJAPOПП

// Если не придумаешь как сделать, пиши Дмитрию за подсказкой.
// 5а. Улучшить 5 что бы принимать ввод данных с консоли nodejs.
https://qna.habr.com/answer?answer_id=1146773#answers_list_answer