//6.3. Решить задачу 5.3 без использования toLowerCase и toUpperCase
// 3. Написать функцию которая преобразует текст в веррхний регистр
// сделать разными способами, если получится
let letters = {
    'a':'A',
    'b':'B',
    'c':'C',
    'd':'D',
    'e':'E',
    'f':'F',
    'g':'J',
    'h':'H',
    'i':'I',
    'j':'J',
    'k':'K',
    'l':'L',
    'm':'M',
    'n':'N',
    'o':'O',
    'p':'P',
    'q':'Q',
    'r':'R',
    's':'S',
    't':'T',
    'u':'U',
    'v':'V',
    'w':'W',
    'x':'X',
    'y':'Y',
    'z':'Z',
    'а':'А',
    'б':'Б',
    'в':'В',
    'г':'Г',
    'д':'Д',
    'е':'Е',
    'ё':'Ё',
    'ж':'Ж',
    'з':'З',
    'и':'И',
    'й':'Й',
    'к':'К',
    'л':'Л',
    'м':'М',
    'н':'Н',
    'о':'О',
    'п':'П',
    'р':'Р',
    'с':'С',
    'т':'Т',
    'у':'У',
    'ф':'Ф',
    'х':'Ч',
    'ц':'Ц',
    'ч':'Ч',
    'ш':'Ш',
    'щ':'Щ',
    'ъ':'Ъ',
    'ы':'Ы',
    'ь':'Ь',
    'э':'Э',
    'ю':'Ю',
    'я':'Я'
}
function toUpper (string) {
   let arrofChars = string.split("");
   let res = [];
    for (let i = 0; i < arrofChars.length; i++) {
        if(letters[arrofChars[i]]){
            res.push(letters[arrofChars[i]]);
        }
        else{
            res.push(arrofChars[i]);
        }
    }
    return res.join("");
}
console.log(toUpper("StroKa1"));